; domain
(define (domain survive_comet_hitting_earth)
   (:requirements :strips :typing)
   (:types
   item
   location
   food water medicine energy_source - item 
   weapon - item
   pistol ammunition - weapon
   bunker city market weapon_market - location
   player direction
   )

   (:predicates
      (inventory ?it - item) ; an item in the player's inventory
      (at ?obj - object ?loc - location) ; an object is at a location
      (in ?obj - object ?c - city) ; an object is in a city
      (enough_supplies)
      (connected ?loc1 - location ?dir - direction ?loc2 - location) ; location 1 is connected to location 2 in the direction
      (has_air_filtration_system ?bk - bunker) ; bunker has air filtration system
      (has_strong_material ?bk - bunker) ; bunker has strong material
      (has_pc ?p) ; has a pc to listen to broadcast
      (listen_to_broadcast ?p - player ?l - location); listen to astronomers’ predictions on collision with earth
      (coastal ?c - city) ; coastal area
      (inland ?c - city) ;  inland area
      (blocked ?loc1 - location ?dir - direction ?loc2 - location) ; the connection between location 1 and 2 in currently blocked
      (enough_weapons) ;
      (find_good_bunker ?bk - bunker) ;
      (outfit_bunker_with_heat ?bk - bunker) ;
      (enjoylife ?p - player ?bk - bunker) ;
      (family_memebers_know_you_are_safe) ;
   )

   (:action listen_to_astronomers_predictions ; listen to astronomers’ predictions on collision with earth
      :parameters (?p - player ?l1 - location) 
      :precondition (and (at ?p ?l1) (has_pc ?p))
      :effect (and (listen_to_broadcast ?p ?l1))
   )

   (:action move_away ; flight from coastal area to inland area 
      :parameters (?p - player ?c1 - city ?c2 - city ?l1 - location) 
      :precondition (and (in ?p ?c1) (coastal ?c1) (inland ?c2) (listen_to_broadcast ?p ?l1))
      :effect (and (in ?p ?c2) (not (in ?p ?c1)))
   )

   (:action go ; navigate to an adjacent location 
      :parameters (?dir - direction ?p - player ?l1 - location ?l2 - location) 
      :precondition (and (at ?p ?l1) (connected ?l1 ?dir ?l2) (not (blocked ?l1 ?dir ?l2)))
      :effect (and (at ?p ?l2) (not (at ?p ?l1)))
   )

   (:action buy_supplies ; buy supplies and put it in the inventory
      :parameters (?item - item ?p - player ?l1 - market) 
      :precondition (and (at ?p ?l1) (at ?item ?l1))
      :effect (and (inventory ?item))
   )

   (:action check_supplies ; check enough supplies in the inventory
      :parameters (?fd - food ?wt - water ?md - medicine) 
      :precondition (and (inventory ?fd) (inventory ?wt) (inventory ?md))
      :effect (and (enough_supplies))
   )

   (:action buy_weapons ; buy weapons and put it in the inventory (after buy_supplies)
      :parameters (?wp - weapon ?p - player ?l1 - weapon_market) 
      :precondition (and (at ?p ?l1) (at ?wp ?l1) (enough_supplies))
      :effect (and (inventory ?wp))
   )

   (:action check_weapons ; check enough supplies in the inventory
      :parameters (?ps - pistol ?am - ammunition) 
      :precondition (and (inventory ?ps) (inventory ?am))
      :effect (and (enough_weapons))
   )

   (:action check_bunker ; check if the bunker is good for sheiding
      :parameters (?bk - bunker ?p - player) 
      :precondition (and (at ?p ?bk) (enough_supplies) (enough_weapons) (has_air_filtration_system ?bk) (has_strong_material ?bk))
      :effect (and (find_good_bunker ?bk))
   )

   (:action outfit_bunker_with_energy_source ; outfit your bunker with an energy source for heat
      :parameters (?bk - bunker ?p - player ?es - energy_source) 
      :precondition (and (at ?p ?bk) (find_good_bunker ?bk) (inventory ?es))
      :effect (and (outfit_bunker_with_heat ?bk))
   )

   (:action enjoylife ; after all preparation, enjoy life in a bunker
      :parameters (?bk - bunker ?p - player ) 
      :precondition (and (at ?p ?bk) (outfit_bunker_with_heat ?bk))
      :effect (and (enjoylife ?p ?bk))
   )

   (:action connect_through_social_media_with_family ; let other family members know you are safe
      :parameters (?bk - bunker ?p - player ?f - player ?c - city) 
      :precondition (and (at ?p ?bk) (has_pc ?p) (enjoylife ?p ?bk) (not(at ?f ?bk)) (in ?p ?c) (not (in ?f ?c)) )
      :effect (and (family_memebers_know_you_are_safe))
   )
   

)

; problem
(define (problem move_to_bunker)
   (:domain survive_comet_hitting_earth)

   (:objects
      npc - player
      market - market
      weapon_market - weapon_market
      home - location
      in out north south east west up down - direction
      water - water 
      food - food 
      medicine - medicine
      heat - energy_source
      pistol - pistol 
      ammunition - ammunition
      bunker1 bunker2 - bunker
   )

   (:init
      (connected home west market)
      (connected market east home)
      (connected market west weapon_market)
      (connected weapon_market east market)
      (connected home north bunker1)
      (connected bunker1 south home)
      (connected bunker1 north bunker2)
      (connected bunker2 south bunker1)
      (has_air_filtration_system bunker1)
      (has_air_filtration_system bunker2) 
      (has_strong_material bunker2)
      (at npc home)
      (at food market)
      (at water market)
      (at medicine market)
      (at pistol weapon_market)
      (at ammunition weapon_market)
      (at heat market)
   )

   (:goal (and (outfit_bunker_with_heat bunker2) (enough_weapons) (enough_supplies)))
)

; plan
1. (go west npc home market)
   deleted: (at npc home)
   added: (at npc market)
   goals met: 0 of 3
2. (buy_supplies food npc market)
   added: (inventory food)
   goals met: 0 of 3
3. (buy_supplies medicine npc market)
   added: (inventory medicine)
   goals met: 0 of 3
4. (buy_supplies water npc market)
   added: (inventory water)
   goals met: 0 of 3
5. (check_supplies food water medicine)
   added: (enough_supplies)
   goals met: 1 of 3
6. (go west npc market weapon_market)
   deleted: (at npc market)
   added: (at npc weapon_market)
   goals met: 1 of 3
7. (buy_weapons ammunition npc weapon_market)
   added: (inventory ammunition)
   goals met: 1 of 3
8. (buy_weapons pistol npc weapon_market)
   added: (inventory pistol)
   goals met: 1 of 3
9. (go east npc weapon_market market)
   deleted: (at npc weapon_market)
   added: (at npc market)
   goals met: 1 of 3
10. (buy_supplies heat npc market)
   added: (inventory heat)
   goals met: 1 of 3
11. (go east npc market home)
   deleted: (at npc market)
   added: (at npc home)
   goals met: 1 of 3
12. (go north npc home bunker1)
   deleted: (at npc home)
   added: (at npc bunker1)
   goals met: 1 of 3
13. (go north npc bunker1 bunker2)
   deleted: (at npc bunker1)
   added: (at npc bunker2)
   goals met: 1 of 3
14. (check_weapons pistol ammunition)
   added: (enough_weapons)
   goals met: 2 of 3
15. (check_bunker bunker2 npc)
   added: (find_good_bunker bunker2)
   goals met: 2 of 3
16. (outfit_bunker_with_energy_source bunker2 npc heat)
   added: (outfit_bunker_with_heat bunker2)
   goals met: 3 of 3
